---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementSetIterator
source: html/9922da1f-e771-0f31-04e9-9c518fd8101d.htm
---
# ElementSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.